In [2]:
import sqlite3

In [3]:
# First connection object

db=sqlite3.connect("student_database.db")

In [4]:
# create cursor object from connection (cur is created that means temprory work area is created)

cur=db.cursor()

# Create table in student_database

In [5]:
# forming table named student in "student_database.db"
# Primary key is a constraint(it will not allow any blank data within it nor any dublicate)

cur.execute("create table student(id int Primary key,name text,marks int)")

In [6]:
cur.execute("insert into student(id,name,marks) values(1,'Ram',80)")
db.commit()

In [7]:
# Finding cur(cursor) row counts

print(cur.rowcount,"Record(s) inserted")

1 Record(s) inserted

In [8]:
cur.execute("insert into student(id,name,marks) values(2,'teena',90)")
db.commit()

In [9]:
print(cur.rowcount,"Record(s) inserted")

1 Record(s) inserted

In [10]:
results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'Ram', 80)
(2, 'teena', 90)

In [11]:
cur.execute("insert into student values(3,'roni', 98)")

In [12]:
cur.execute("insert into student values(4,'Amit',100)")
db.commit()

In [13]:
cur.execute(" insert into student values(5,'john', 60)")
db.commit()

In [14]:
resultss=cur.execute("Select * from student")

for row in resultss:
    print(row)

(1, 'Ram', 80)
(2, 'teena', 90)
(3, 'roni', 98)
(4, 'Amit', 100)
(5, 'john', 60)

In [15]:
cur.execute("insert into student values(8,'tina',80)")
db.commit()

In [16]:
cur.execute("Insert into student values(11,'pawan',100)")
db.commit()

In [17]:
cur.execute("Insert into student values(15,'rabi',100)")
db.commit()

In [18]:
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'Ram', 80)
(2, 'teena', 90)
(3, 'roni', 98)
(4, 'Amit', 100)
(5, 'john', 60)
(8, 'tina', 80)
(11, 'pawan', 100)
(15, 'rabi', 100)

In [19]:
cur.execute("insert into student Values(21,'rohit',50)")
db.commit()

In [20]:
results=cur.execute("Select * from student")

for i in results:
    print(i)

(1, 'Ram', 80)
(2, 'teena', 90)
(3, 'roni', 98)
(4, 'Amit', 100)
(5, 'john', 60)
(8, 'tina', 80)
(11, 'pawan', 100)
(15, 'rabi', 100)
(21, 'rohit', 50)

In [21]:
cur.execute(" insert into student values(22,'kabir',59),(23,'Anil',40)")
db.commit()

print(cur.rowcount,'Records insercted')

2 Records insercted

In [22]:
cur.execute(" insert into student values(24,'Nikhil',75),(27,'pandu',80)")

In [23]:
db.commit()

In [24]:
result1=cur.execute("Select * from student")

for i in result1:
    print(i)

(1, 'Ram', 80)
(2, 'teena', 90)
(3, 'roni', 98)
(4, 'Amit', 100)
(5, 'john', 60)
(8, 'tina', 80)
(11, 'pawan', 100)
(15, 'rabi', 100)
(21, 'rohit', 50)
(22, 'kabir', 59)
(23, 'Anil', 40)
(24, 'Nikhil', 75)
(27, 'pandu', 80)

In [26]:
cur.execute("insert into student values(28,'Pankaj',60)")
db.commit()

In [27]:
cur.execute("insert into student values(30,'ravi',92)")
db.commit()

In [32]:
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'Ram', 80)
(2, 'teena', 90)
(3, 'roni', 98)
(4, 'Amit', 100)
(5, 'john', 60)
(8, 'tina', 80)
(11, 'pawan', 100)
(15, 'rabi', 100)
(21, 'rohit', 50)
(22, 'kabir', 59)
(23, 'Anil', 40)
(24, 'Nikhil', 75)
(27, 'pandu', 80)
(28, 'Pankaj', 60)
(30, 'ravi', 92)
(40, 'Tannu', 98)
(31, 'Tannu', 99)

In [34]:
cur.execute("insert into student values(32,'Umesh',100)")
db.commit()

IntegrityError: UNIQUE constraint failed: student.id

In [35]:
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'Ram', 80)
(2, 'teena', 90)
(3, 'roni', 98)
(4, 'Amit', 100)
(5, 'john', 60)
(8, 'tina', 80)
(11, 'pawan', 100)
(15, 'rabi', 100)
(21, 'rohit', 50)
(22, 'kabir', 59)
(23, 'Anil', 40)
(24, 'Nikhil', 75)
(27, 'pandu', 80)
(28, 'Pankaj', 60)
(30, 'ravi', 92)
(40, 'Tannu', 98)
(31, 'Tannu', 99)
(32, 'Umesh', 100)

In [1]:
import sqlite3

In [2]:
db=sqlite3.connect("Student_database.db")

In [3]:
cur=db.cursor()

In [4]:
results=cur.execute("select * from student")

for i in result:
    print(i)

(1, 'Ram', 80)
(2, 'teena', 90)
(3, 'roni', 98)
(4, 'Amit', 100)
(5, 'john', 60)
(8, 'tina', 80)
(11, 'pawan', 100)
(15, 'rabi', 100)
(21, 'rohit', 50)
(22, 'kabir', 59)
(23, 'Anil', 40)
(24, 'Nikhil', 75)
(27, 'pandu', 80)
(28, 'Pankaj', 60)
(30, 'ravi', 92)

In [6]:
cur.execute("insert into student values(51,'ram',98)")
db.commit()

In [7]:
cur.execute("insert into student values(52,'Umesh',100)")
db.commit()

In [2]:
import sqlite3

In [3]:
db=sqlite3.connect("student_database.db")

In [4]:
cur=db.cursor

In [8]:
cur=db.cursor()

In [10]:
result=cur.execute("select * from student")

In [12]:
for i in result:
    print(i)

(1, 'Ram', 80)
(2, 'teena', 90)
(3, 'roni', 98)
(4, 'Amit', 100)
(5, 'john', 60)
(8, 'tina', 80)
(11, 'pawan', 100)
(15, 'rabi', 100)
(21, 'rohit', 50)
(22, 'kabir', 59)
(23, 'Anil', 40)
(24, 'Nikhil', 75)
(27, 'pandu', 80)
(28, 'Pankaj', 60)
(30, 'ravi', 92)
(51, 'ram', 98)
(52, 'Umesh', 100)

In [14]:
cur.execute("insert into student values(53,'jhonty',35),(54,'juhi',60),(55,'romio',80)")
db.commit()

In [15]:
print(cur.rowcount,'Records insercted')

3 Records insercted

In [16]:
result=cur.execute("select * from student")

In [17]:
for i in result:
    print(i)

(1, 'Ram', 80)
(2, 'teena', 90)
(3, 'roni', 98)
(4, 'Amit', 100)
(5, 'john', 60)
(8, 'tina', 80)
(11, 'pawan', 100)
(15, 'rabi', 100)
(21, 'rohit', 50)
(22, 'kabir', 59)
(23, 'Anil', 40)
(24, 'Nikhil', 75)
(27, 'pandu', 80)
(28, 'Pankaj', 60)
(30, 'ravi', 92)
(51, 'ram', 98)
(52, 'Umesh', 100)
(53, 'jhonty', 35)
(54, 'juhi', 60)
(55, 'romio', 80)

data base will be created in the given location

In [1]:
import sqlite3

In [2]:
db1=sqlite3.connect("Employee_DataBase")

In [3]:
cur=db1.cursor()

In [5]:
cur.execute(" create table employee(id int, name text, age int)")

In [7]:
cur.execute("insert into employee values(121,'abhijit',30)")
db1.commit()

In [8]:
cur.execute("insert into employee values(122,'Aman',30)")
db1.commit()

In [10]:
cur.execute("insert into employee values(123,'Ritesh',32)")
db1.commit()

In [12]:
result=cur.execute("select * from employee")

for i in result:
    print(i)

(121, 'abhijit', 30)
(121, 'abhijit', 30)
(122, 'Aman', 30)
(123, 'Ritesh', 32)

In [13]:
print(cur.rowcount)

-1

In [14]:
cur.execute("insert into employee values(124,'Ravi',34),(125,'Era',35)")

In [16]:
db1.commit()

In [19]:
cur.execute("insert into employee values(126,'ji',36),(127,'lko',37),(128,'kilo',38)")
db1.commit()

In [20]:
print(cur.rowcount)

3

In [21]:
result1=cur.execute("select * from employee")

for i in result1:
    print(i)

(121, 'abhijit', 30)
(121, 'abhijit', 30)
(122, 'Aman', 30)
(123, 'Ritesh', 32)
(124, 'Ravi', 34)
(125, 'Era', 35)
(126, 'ji', 36)
(127, 'lko', 37)
(128, 'kilo', 38)

In [22]:
import sqlite3

In [24]:
db1=sqlite3.connect("Employee_DataBase")

In [25]:
cur=db1.cursor()

In [32]:
result=cur.execute("select * from employee")

In [33]:
for i in result:
    print(i)

(121, 'abhijit', 30)
(121, 'abhijit', 30)
(122, 'Aman', 30)
(123, 'Ritesh', 32)
(124, 'Ravi', 34)
(125, 'Era', 35)
(126, 'ji', 36)
(127, 'lko', 37)
(128, 'kilo', 38)

In [1]:
import sqlite3

In [2]:
db1=sqlite3.connect("Employee_DataBase")

In [5]:
cur=db1.cursor()

In [6]:
results=cur.execute("select * from employee")

In [7]:
for i in results:
    print(i)

(121, 'abhijit', 30)
(121, 'abhijit', 30)
(122, 'Aman', 30)
(123, 'Ritesh', 32)
(124, 'Ravi', 34)
(125, 'Era', 35)
(126, 'ji', 36)
(127, 'lko', 37)
(128, 'kilo', 38)

In [8]:
cur.execute("insert into employee values(129,'jack',34),(130,'jill',35)")
db1.commit()

In [10]:
# printing rows 

print(cur.rowcount)

2

# ACCESSING data stored in SQLite using PYTHON

In [11]:
# selcting all from employee

result=cur.execute("Select * from employee")

In [12]:
for i in result:
    print(i)

(121, 'abhijit', 30)
(121, 'abhijit', 30)
(122, 'Aman', 30)
(123, 'Ritesh', 32)
(124, 'Ravi', 34)
(125, 'Era', 35)
(126, 'ji', 36)
(127, 'lko', 37)
(128, 'kilo', 38)
(129, 'jack', 34)
(130, 'jill', 35)

In [20]:
result=cur.execute("select id from employee")

for i in result:
    print(i, end=" ")

(121,) (121,) (122,) (123,) (124,) (125,) (126,) (127,) (128,) (129,) (130,)

In [19]:
result=cur.execute("select name from employee")

for i in result:
    print(i,end=" ")

('abhijit',) ('abhijit',) ('Aman',) ('Ritesh',) ('Ravi',) ('Era',) ('ji',) ('lko',) ('kilo',) ('jack',) ('jill',)

In [18]:
result=cur.execute("select age from employee")

for i in result:
    print(i,end=" ")

(30,) (30,) (30,) (32,) (34,) (35,) (36,) (37,) (38,) (34,) (35,)

In [23]:
result=cur.execute("select age,id from employee")

for i in result:
    print(i,end=" ")

(30, 121) (30, 121) (30, 122) (32, 123) (34, 124) (35, 125) (36, 126) (37, 127) (38, 128) (34, 129) (35, 130)

In [24]:
result=cur.execute("select id,name,age from employee")

for i in result:
    print(i,end=" ")

(121, 'abhijit', 30) (121, 'abhijit', 30) (122, 'Aman', 30) (123, 'Ritesh', 32) (124, 'Ravi', 34) (125, 'Era', 35) (126, 'ji', 36) (127, 'lko', 37) (128, 'kilo', 38) (129, 'jack', 34) (130, 'jill', 35)

In [25]:
"thank you"

'thank you'